xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxPms_bf.h
/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.FBADCBLNK */
#define IFX_PMS_EVRSDCTRL8_FBADCBLNK_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.FBADCBLNK */
#define IFX_PMS_EVRSDCTRL8_FBADCBLNK_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.FBADCBLNK */
#define IFX_PMS_EVRSDCTRL8_FBADCBLNK_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.FBADCLPF */
#define IFX_PMS_EVRSDCTRL8_FBADCLPF_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.FBADCLPF */
#define IFX_PMS_EVRSDCTRL8_FBADCLPF_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.FBADCLPF */
#define IFX_PMS_EVRSDCTRL8_FBADCLPF_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.FBADCERR */
#define IFX_PMS_EVRSDCTRL8_FBADCERR_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.FBADCERR */
#define IFX_PMS_EVRSDCTRL8_FBADCERR_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.FBADCERR */
#define IFX_PMS_EVRSDCTRL8_FBADCERR_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.FBADCLSB */
#define IFX_PMS_EVRSDCTRL8_FBADCLSB_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.FBADCLSB */
#define IFX_PMS_EVRSDCTRL8_FBADCLSB_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.FBADCLSB */
#define IFX_PMS_EVRSDCTRL8_FBADCLSB_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.LCK */
#define IFX_PMS_EVRSDCTRL8_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.LCK */
#define IFX_PMS_EVRSDCTRL8_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.LCK */
#define IFX_PMS_EVRSDCTRL8_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL9_Bits.FFADCOFFS */
#define IFX_PMS_EVRSDCTRL9_FFADCOFFS_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL9_Bits.FFADCOFFS */
#define IFX_PMS_EVRSDCTRL9_FFADCOFFS_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL9_Bits.FFADCOFFS */
#define IFX_PMS_EVRSDCTRL9_FFADCOFFS_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL9_Bits.FFADCLPF */
#define IFX_PMS_EVRSDCTRL9_FFADCLPF_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL9_Bits.FFADCLPF */
#define IFX_PMS_EVRSDCTRL9_FFADCLPF_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL9_Bits.FFADCLPF */
#define IFX_PMS_EVRSDCTRL9_FFADCLPF_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL9_Bits.LCK */
#define IFX_PMS_EVRSDCTRL9_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL9_Bits.LCK */
#define IFX_PMS_EVRSDCTRL9_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL9_Bits.LCK */
#define IFX_PMS_EVRSDCTRL9_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL10_Bits.SHVH */
#define IFX_PMS_EVRSDCTRL10_SHVH_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL10_Bits.SHVH */
#define IFX_PMS_EVRSDCTRL10_SHVH_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL10_Bits.SHVH */
#define IFX_PMS_EVRSDCTRL10_SHVH_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL10_Bits.SHVL */
#define IFX_PMS_EVRSDCTRL10_SHVL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL10_Bits.SHVL */
#define IFX_PMS_EVRSDCTRL10_SHVL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL10_Bits.SHVL */
#define IFX_PMS_EVRSDCTRL10_SHVL_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL10_Bits.SHHVEN */
#define IFX_PMS_EVRSDCTRL10_SHHVEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL10_Bits.SHHVEN */
#define IFX_PMS_EVRSDCTRL10_SHHVEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL10_Bits.SHHVEN */
#define IFX_PMS_EVRSDCTRL10_SHHVEN_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCTRL10_Bits.SHLVEN */
#define IFX_PMS_EVRSDCTRL10_SHLVEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL10_Bits.SHLVEN */
#define IFX_PMS_EVRSDCTRL10_SHLVEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL10_Bits.SHLVEN */
#define IFX_PMS_EVRSDCTRL10_SHLVEN_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCTRL11_Bits.DROOPVH */
#define IFX_PMS_EVRSDCTRL11_DROOPVH_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL11_Bits.DROOPVH */
#define IFX_PMS_EVRSDCTRL11_DROOPVH_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL11_Bits.DROOPVH */
#define IFX_PMS_EVRSDCTRL11_DROOPVH_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL11_Bits.DROOPVL */
#define IFX_PMS_EVRSDCTRL11_DROOPVL_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL11_Bits.DROOPVL */
#define IFX_PMS_EVRSDCTRL11_DROOPVL_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL11_Bits.DROOPVL */
#define IFX_PMS_EVRSDCTRL11_DROOPVL_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL11_Bits.SYNCMAXDEV */
#define IFX_PMS_EVRSDCTRL11_SYNCMAXDEV_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL11_Bits.SYNCMAXDEV */
#define IFX_PMS_EVRSDCTRL11_SYNCMAXDEV_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL11_Bits.SYNCMAXDEV */
#define IFX_PMS_EVRSDCTRL11_SYNCMAXDEV_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL11_Bits.SYNCHYST */
#define IFX_PMS_EVRSDCTRL11_SYNCHYST_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL11_Bits.SYNCHYST */
#define IFX_PMS_EVRSDCTRL11_SYNCHYST_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL11_Bits.SYNCHYST */
#define IFX_PMS_EVRSDCTRL11_SYNCHYST_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL11_Bits.SYNCMUXSEL */
#define IFX_PMS_EVRSDCTRL11_SYNCMUXSEL_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL11_Bits.SYNCMUXSEL */
#define IFX_PMS_EVRSDCTRL11_SYNCMUXSEL_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL11_Bits.SYNCMUXSEL */
#define IFX_PMS_EVRSDCTRL11_SYNCMUXSEL_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCTRL11_Bits.LCK */
#define IFX_PMS_EVRSDCTRL11_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL11_Bits.LCK */
#define IFX_PMS_EVRSDCTRL11_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL11_Bits.LCK */
#define IFX_PMS_EVRSDCTRL11_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S0EN */
#define IFX_PMS_EVRSDCOEFF0_M0S0EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S0EN */
#define IFX_PMS_EVRSDCOEFF0_M0S0EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S0EN */
#define IFX_PMS_EVRSDCOEFF0_M0S0EN_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2EN */
#define IFX_PMS_EVRSDCOEFF0_M0S2EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2EN */
#define IFX_PMS_EVRSDCOEFF0_M0S2EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2EN */
#define IFX_PMS_EVRSDCOEFF0_M0S2EN_OFF (1u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S3EN */
#define IFX_PMS_EVRSDCOEFF0_M0S3EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S3EN */
#define IFX_PMS_EVRSDCOEFF0_M0S3EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S3EN */
#define IFX_PMS_EVRSDCOEFF0_M0S3EN_OFF (2u)

